In [3]:
import pandas as pd

In [16]:
from os import walk

filenames = next(walk('./VOGData/'), (None, None, []))[2]  # [] if no file
# sauce: https://stackoverflow.com/a/3207973

In [25]:
def get_common_columns(files, **kwargs):
    """Get set intersection of column-names of specified CSV files"""
    common_columns = set(pd.read_csv('./VOGData/' + files[0], nrows=0, **kwargs).columns)
    for f in files:
        common_columns &= set(pd.read_csv('./VOGData/' + f, nrows=0, **kwargs).columns)
    return common_columns

In [26]:
get_common_columns(filenames)

{'COST CENTRE'}

### LOOOOO0L! {'COST CENTRE'}

In [27]:
len(filenames)

57

In [28]:
df1 = pd.read_csv("./VOGData/Payables-Greater-than-500-April-2018.csv")
df1

,Directorate,Sub Directorate,Accounting Date,COST CENTRE,Supplier Name,Net Amount,Type
0,DIRECT ENVIRONMENT AND HOUSING,VEHICLES,01-Apr-18,319000,UK Telematics Limited,865.40,Revenue
1,DIRECT ENVIRONMENT AND HOUSING,VEHICLES,01-Apr-18,319000,UK Telematics Limited,5202.39,Revenue
2,DIRECT ENVIRONMENT AND HOUSING,VEHICLES,01-Apr-18,319000,UK Telematics Limited,727.35,Revenue
3,DIRECT SOCIAL SERVICES,GF ADULT SERVICES,03-Apr-18,215489,1st Grade Care Limited,514.78,Revenue
4,DIRECT SOCIAL SERVICES,GF ADULT SERVICES,03-Apr-18,215489,1st Grade Care Limited,593.18,Revenue
...,...,...,...,...,...,...,...
2260,DIRECT LEARNING AND SKILLS,SCHOOLS DELEGATED,30-Apr-18,101195,New Directions (Education) Limited,612.05,Revenue
2261,DIRECT LEARNING AND SKILLS,SCHOOLS NON DELEGATED,30-Apr-18,103202,Valley Education Services Limited,813.84,Revenue
2262,DIRECT MANAGING DIRECTOR AND RESOURCES,GF RESOURCES,30-Apr-18,422160,Anderselite Limited,725.00,Revenue
2263,DIRECT LEARNING AND SKILLS,CATERING,30-Apr-18,150401,Russel Bishop t/a WR Bishop & Co,2394.70,Revenue
2264,DIRECT SOCIAL SERVICES,GF CHILDREN SERVICES,30-Apr-18,260060,Barnardos Cymru,2978.57,Revenue

In [30]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2265 entries, 0 to 2264
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Directorate      2265 non-null   object
 1   Sub Directorate  2265 non-null   object
 2   Accounting Date  2265 non-null   object
 3   COST CENTRE      2265 non-null   int64
 4   Supplier Name    2265 non-null   object
 5   Net Amount       2265 non-null   float64
 6   Type             2265 non-null   object
dtypes: float64(1), int64(1), object(5)
memory usage: 124.0+ KB

In [32]:
df1.describe()

         COST CENTRE     Net Amount
count    2265.000000    2265.000000
mean   273014.166887    4621.689210
std    154659.334889   23886.274436
min    100121.000000  -66824.720000
25%    215489.000000     600.000000
50%    217909.000000     837.200000
75%    325340.000000    1999.500000
max    852515.000000  562810.550000